---
kind: other
id: Methods.T:Autodesk.Revit.DB.PanelTypeSet
source: html/85944d68-791b-11da-b360-c9433d723c9d.htm
---
# PanelTypeSet Methods

Removes every panel type from the set, rendering it empty.